blog/2016/10/20/influxdb-load-test-design/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
    <title>InfluxDB负载测试设计 - Shane Xu&#39;s Home</title>
    <meta charset="utf-8" />
    <meta name="author" content="Shane Xu" />
      <meta name="description" content="&lt;TODO: insert your description here&gt;" />
      <meta name="keywords" content="influxdb, go" />
    <link rel="stylesheet" href="/media/source-code-pro/source-code-pro.css" type="text/css">
    <link rel="stylesheet" href="/media/css/org-manual.css" type="text/css">
    <link rel="stylesheet" href="/media/css/extra.css" type="text/css">
    <link rel="stylesheet" href="/media/css/code-dark.css" type="text/css">
  </head>

  <body>
    <div>
      <header class="masthead">
        <h1 class="settitle"><a href="/">Shane Xu&#39;s Home</a></h1>
        <blockquote>Life is too short for so much sorrow.</blockquote>
        <form method="get" id="searchform" action="//www.google.com/search">
          <input type="text" class="field" name="q" id="s" placeholder="Search">
          <input type="hidden" name="as_sitesearch" value="xusheng.org">
        </form>
      </header>
    </div>
    <div class="node nav">
      <ul>
          <li><a href="/blog/">Blog</a></li>
        <li><a href="/tags/">Tags</a></li>
        <li><a href="/about/">About</a></li>
        <li><a href="https://github.com/shanexu">GitHub</a></li>
        <li><a href="/rss.xml">RSS</a></li>
      </ul>
      <hr/>
    </div>


  <h3 class="section">InfluxDB负载测试设计</h3>

<div id="outline-container-org396b1fb" class="outline-2">
<h2 id="org396b1fb">重新看一遍tsm1的DESIGN.md</h2>
<div class="outline-text-2" id="text-org396b1fb">
</div>
<div id="outline-container-org2720fee" class="outline-3">
<h3 id="org2720fee">数据写入</h3>
<div class="outline-text-3" id="text-org2720fee">
<p>
Write throughput is bounded by the time to process the write on the CPU (parsing, sorting, etc..), adding and evicting to the Cache and appending the write to the WAL.  The first two items are CPU bound and can be tuned and optimized if they become a bottleneck.  The WAL write can be tuned such that in the worst case every write requires at least 2 IOPS (write + fsync) or batched so that multiple writes are queued and fsync'd in sizes matching one or more disk blocks.  Performing more work with each IO will improve throughput
</p>

<p>
Write latency is minimal for the WAL write since there are no seeks.  The latency is bounded by the time to complete any write and fsync calls.
</p>
</div>
</div>
<div id="outline-container-org3c6bc50" class="outline-3">
<h3 id="org3c6bc50">数据查询</h3>
<div class="outline-text-3" id="text-org3c6bc50">
<p>
Query throughput is directly related to how many blocks can be read in a period of time.  The index structure contains enough information to determine if one or multiple blocks can be read in a single IO.
</p>

<p>
Query latency is determine by how long it takes to find and read the relevant blocks.  The in-memory index structure contains the offsets and sizes of all blocks for a key.  This allows every block to be read in 2 IOPS (seek + read) regardless of position, structure or size of file.
</p>
</div>
</div>

<div id="outline-container-orgd8ca1e9" class="outline-3">
<h3 id="orgd8ca1e9">我粗鄙的结论</h3>
<div class="outline-text-3" id="text-orgd8ca1e9">
<p>
我一直认为influxdb的瓶颈不在写，而是在于读。
</p>
</div>
</div>
</div>

<div id="outline-container-orgeb68f4a" class="outline-2">
<h2 id="orgeb68f4a">压力测试工具选择</h2>
<div class="outline-text-2" id="text-orgeb68f4a">
<p>
前几天看到ES的测试工具 <a href="https://github.com/elastic/rally">rally</a> 中用了Actor模型，于是突发奇想，找一个基于Akka的测试工具，于是找到了 <a href="http://gatling.io/">gatling</a> 。我的想法是如果底层使用Akka的话, 利用Akka-cluster应该很容易实现分布式测试。然而这个功能在商业版中才有。<a href="https://github.com/gatling/gatling/issues/415">https://github.com/gatling/gatling/issues/415</a>
</p>
</div>
</div>

<div id="outline-container-orgb8192d0" class="outline-2">
<h2 id="orgb8192d0">Gatling简单的使用方法</h2>
<div class="outline-text-2" id="text-orgb8192d0">
</div>
<div id="outline-container-org4841613" class="outline-3">
<h3 id="org4841613">使用Zip bundle</h3>
<div class="outline-text-3" id="text-org4841613">
<p>
从 <a href="https://repo1.maven.org/maven2/io/gatling/highcharts/gatling-charts-highcharts-bundle/2.2.2/gatling-charts-highcharts-bundle-2.2.2-bundle.zip">https://repo1.maven.org/maven2/io/gatling/highcharts/gatling-charts-highcharts-bundle/2.2.2/gatling-charts-highcharts-bundle-2.2.2-bundle.zip</a> 下载zip包。并解压到某处，然后在 <code>user-files/simulations/computerdatabase/</code> 目录里面增加test case。
用这种方式，有个弊端，就是我想添加依赖的jar包的话，就只能手动将包放到 <code>lib</code> 下面。
</p>
</div>
</div>

<div id="outline-container-org3e5bc4b" class="outline-3">
<h3 id="org3e5bc4b">或者使用SBT Plugin</h3>
<div class="outline-text-3" id="text-org3e5bc4b">
<div class="org-src-container">
<pre class="src src-bash">git clone https://github.com/gatling/gatling-sbt-plugin-demo.git
</pre>
</div>
<p>
从 github clone 官方提供的，使用 <code>gatling-sbt</code> 插件的 demo，然后在 <code>src/it/scala</code> 中增加test case就可以了。
在写完test case 之后，运行 <code>sbt gatling-it:testOnly a.b.c(完整类名)</code> 就可以了。
</p>
</div>
</div>
</div>

<div id="outline-container-org0cf6a23" class="outline-2">
<h2 id="org0cf6a23">简单的test case</h2>
<div class="outline-text-2" id="text-org0cf6a23">
<p>
Gatling自己有一套完整的http调用的api，并且压力测试还需依赖于通过这套api获得的请求结果，所以 <code>influxdb-java</code> 的client在这里没有用武之地。但是这个包的完整的influxdb的dto，却是非常有用。于是在工程里添加依赖。
</p>
<div class="org-src-container">
<pre class="src src-scala">libraryDependencies += <span style="color: #7FA0B7;">"org.influxdb"</span> % <span style="color: #7FA0B7;">"influxdb-java"</span> % <span style="color: #7FA0B7;">"2.3"</span>
</pre>
</div>
</div>

<div id="outline-container-org1635c6f" class="outline-3">
<h3 id="org1635c6f">一个简单的query test case</h3>
<div class="outline-text-3" id="text-org1635c6f">
<div class="org-src-container">
<pre class="src src-scala"><span class="linenr"> 1: </span><span style="color: #5EC4FF;">package</span> <span style="color: #7FA0B7;">org.xusheng.influxdbloadtest</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #5EC4FF;">import</span> io.gatling.core.<span style="color: #D95468;">Predef</span>.<span style="color: #5EC4FF;">_</span>
<span class="linenr"> 4: </span><span style="color: #5EC4FF;">import</span> io.gatling.http.<span style="color: #D95468;">Predef</span>.<span style="color: #5EC4FF;">_</span>
<span class="linenr"> 5: </span><span style="color: #5EC4FF;">import</span> scala.concurrent.duration.<span style="color: #5EC4FF;">_</span>
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #5EC4FF;">class</span> <span style="color: #EBBF83;">InfluxQuerySimulation</span> <span style="color: #5EC4FF;">extends</span> <span style="color: #EBBF83;">Simulation</span> <span style="color: #5EC4FF;">{</span>
<span class="linenr"> 8: </span>  <span style="color: #5EC4FF;">val</span> <span style="color: #9CAABB;">httpConf</span> <span style="color: #5EC4FF;">=</span> http
<span class="linenr"> 9: </span>    .baseURL<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"http://127.0.0.1:8086"</span><span style="color: #E27E8D;">)</span>
<span class="linenr">10: </span>
<span class="linenr">11: </span>  <span style="color: #5EC4FF;">val</span> <span style="color: #9CAABB;">h</span> <span style="color: #5EC4FF;">=</span> http<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"query"</span><span style="color: #E27E8D;">)</span>.get<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"/query"</span><span style="color: #E27E8D;">)</span>.queryParam<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"db"</span>, <span style="color: #7FA0B7;">"mytest"</span><span style="color: #E27E8D;">)</span>.queryParam<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"q"</span>, <span style="color: #7FA0B7;">"select sum(value) from cpu where time &gt; now() - 1m"</span><span style="color: #E27E8D;">)</span>
<span class="linenr">12: </span>
<span class="linenr">13: </span>  <span style="color: #5EC4FF;">val</span> <span style="color: #9CAABB;">scn</span> <span style="color: #5EC4FF;">=</span> scenario<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"query"</span><span style="color: #E27E8D;">)</span>.exec<span style="color: #E27E8D;">(</span>h<span style="color: #E27E8D;">)</span>.pause<span style="color: #E27E8D;">(</span><span style="color: #E27E8D; font-weight: bold;">1</span> minute<span style="color: #E27E8D;">)</span>
<span class="linenr">14: </span>
<span class="linenr">15: </span>  setUp<span style="color: #E27E8D;">(</span>scn.inject<span style="color: #8BD49C;">(</span>atOnceUsers<span style="color: #D98E48;">(</span><span style="color: #E27E8D; font-weight: bold;">1</span><span style="color: #D98E48;">)</span><span style="color: #8BD49C;">)</span><span style="color: #E27E8D;">)</span>.protocols<span style="color: #E27E8D;">(</span>httpConf<span style="color: #E27E8D;">)</span>
<span class="linenr">16: </span><span style="color: #5EC4FF;">}</span>
</pre>
</div>

<p>
influxdb的查询就是一个普通的带query parameter的get请求，所以这里没什么好说的。
</p>
</div>
</div>

<div id="outline-container-orgd0a7dc9" class="outline-3">
<h3 id="orgd0a7dc9">一个简单的write test case</h3>
<div class="outline-text-3" id="text-orgd0a7dc9">
<div class="org-src-container">
<pre class="src src-scala"><span class="linenr"> 1: </span><span style="color: #5EC4FF;">package</span> <span style="color: #7FA0B7;">org.xusheng.influxdbloadtest</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #5EC4FF;">import</span> io.gatling.core.<span style="color: #D95468;">Predef</span>.<span style="color: #5EC4FF;">_</span>
<span class="linenr"> 4: </span><span style="color: #5EC4FF;">import</span> io.gatling.http.<span style="color: #D95468;">Predef</span>.<span style="color: #5EC4FF;">_</span>
<span class="linenr"> 5: </span><span style="color: #5EC4FF;">import</span> java.util.concurrent.<span style="color: #D95468;">TimeUnit</span>
<span class="linenr"> 6: </span><span style="color: #5EC4FF;">import</span> scala.concurrent.duration.<span style="color: #5EC4FF;">_</span>
<span class="linenr"> 7: </span><span style="color: #5EC4FF;">import</span> org.influxdb.dto.<span style="color: #5EC4FF;">_</span>
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span><span style="color: #5EC4FF;">class</span> <span style="color: #EBBF83;">InfluxWriteSimulation</span> <span style="color: #5EC4FF;">extends</span> <span style="color: #EBBF83;">Simulation</span> <span style="color: #5EC4FF;">{</span>
<span class="linenr">10: </span>  <span style="color: #5EC4FF;">val</span> <span style="color: #9CAABB;">httpConf</span> <span style="color: #5EC4FF;">=</span> http
<span class="linenr">11: </span>    .baseURL<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"http://127.0.0.1:8086"</span><span style="color: #E27E8D;">)</span>
<span class="linenr">12: </span>
<span class="linenr">13: </span>  <span style="color: #5EC4FF;">val</span> <span style="color: #9CAABB;">p</span> <span style="color: #5EC4FF;">=</span> <span style="color: #D95468;">Point</span>.measurement<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"cpu"</span><span style="color: #E27E8D;">)</span>.addField<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"value"</span>, scala.util.<span style="color: #D95468;">Random</span>.nextInt<span style="color: #8BD49C;">(</span><span style="color: #E27E8D; font-weight: bold;">100</span><span style="color: #8BD49C;">)</span><span style="color: #E27E8D;">)</span>.tag<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"partner"</span>, <span style="color: #7FA0B7;">"hello"</span><span style="color: #E27E8D;">)</span>.time<span style="color: #E27E8D;">(</span><span style="color: #D95468;">System</span>.nanoTime<span style="color: #8BD49C;">()</span>, <span style="color: #D95468;">TimeUnit</span>.<span style="color: #D95468;">NANOSECONDS</span><span style="color: #E27E8D;">)</span>.build<span style="color: #E27E8D;">()</span>
<span class="linenr">14: </span>
<span class="linenr">15: </span>  <span style="color: #5EC4FF;">val</span> <span style="color: #9CAABB;">h</span> <span style="color: #5EC4FF;">=</span> http<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"write"</span><span style="color: #E27E8D;">)</span>.post<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"/write"</span><span style="color: #E27E8D;">)</span>.body<span style="color: #E27E8D;">(</span><span style="color: #D95468;">StringBody</span><span style="color: #8BD49C;">(</span>p.lineProtocol<span style="color: #D98E48;">()</span><span style="color: #8BD49C;">)</span><span style="color: #E27E8D;">)</span>.queryParam<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"db"</span>, <span style="color: #7FA0B7;">"mytest"</span><span style="color: #E27E8D;">)</span>
<span class="linenr">16: </span>
<span class="linenr">17: </span>  <span style="color: #5EC4FF;">val</span> <span style="color: #9CAABB;">scn</span> <span style="color: #5EC4FF;">=</span> scenario<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"write"</span><span style="color: #E27E8D;">)</span>
<span class="linenr">18: </span>    .exec<span style="color: #E27E8D;">(</span>h<span style="color: #E27E8D;">)</span>.pause<span style="color: #E27E8D;">(</span><span style="color: #E27E8D; font-weight: bold;">1</span> second<span style="color: #E27E8D;">)</span>
<span class="linenr">19: </span>
<span class="linenr">20: </span>  setUp<span style="color: #E27E8D;">(</span>scn.inject<span style="color: #8BD49C;">(</span>atOnceUsers<span style="color: #D98E48;">(</span><span style="color: #E27E8D; font-weight: bold;">1</span><span style="color: #D98E48;">)</span><span style="color: #8BD49C;">)</span><span style="color: #E27E8D;">)</span>.protocols<span style="color: #E27E8D;">(</span>httpConf<span style="color: #E27E8D;">)</span>
<span class="linenr">21: </span><span style="color: #5EC4FF;">}</span>
</pre>
</div>

<p>
这里调用了influxdb-java中dto下面的Point来build的了一个点，然后调用lineProtocol方法获得文本，发送给influxdb。
</p>
</div>
</div>

<div id="outline-container-org868f216" class="outline-3">
<h3 id="org868f216">一个Query 和 Write 组合的test case</h3>
<div class="outline-text-3" id="text-org868f216">
<div class="org-src-container">
<pre class="src src-scala"><span class="linenr"> 1: </span><span style="color: #5EC4FF;">package</span> <span style="color: #7FA0B7;">org.xusheng.influxdbloadtest</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #5EC4FF;">import</span> io.gatling.core.<span style="color: #D95468;">Predef</span>.<span style="color: #5EC4FF;">_</span>
<span class="linenr"> 4: </span><span style="color: #5EC4FF;">import</span> io.gatling.http.<span style="color: #D95468;">Predef</span>.<span style="color: #5EC4FF;">_</span>
<span class="linenr"> 5: </span><span style="color: #5EC4FF;">import</span> scala.concurrent.duration.<span style="color: #5EC4FF;">_</span>
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #5EC4FF;">class</span> <span style="color: #EBBF83;">InfluxWriteQuerySimulation</span> <span style="color: #5EC4FF;">extends</span> <span style="color: #EBBF83;">Simulation</span> <span style="color: #5EC4FF;">{</span>
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>  <span style="color: #5EC4FF;">val</span> <span style="color: #9CAABB;">httpConf</span> <span style="color: #5EC4FF;">=</span> http.baseURL<span style="color: #E27E8D;">(</span><span style="color: #D95468;">Generator</span>.url<span style="color: #E27E8D;">)</span>
<span class="linenr">10: </span>
<span class="linenr">11: </span>  <span style="color: #5EC4FF;">val</span> <span style="color: #9CAABB;">hw</span> <span style="color: #5EC4FF;">=</span> http<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"write"</span><span style="color: #E27E8D;">)</span>
<span class="linenr">12: </span>    .post<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"/write"</span><span style="color: #E27E8D;">)</span>
<span class="linenr">13: </span>    .body<span style="color: #E27E8D;">(</span><span style="color: #D95468;">StringBody</span> <span style="color: #8BD49C;">{</span> session <span style="color: #5EC4FF;">=&gt;</span>
<span class="linenr">14: </span>            <span style="color: #D95468;">Generator</span>.genBatchPoints<span style="color: #D98E48;">(</span>session.userId, isWriter <span style="color: #5EC4FF;">=</span> <span style="color: #D95468;">true</span><span style="color: #D98E48;">)</span>.lineProtocol<span style="color: #D98E48;">()</span>
<span class="linenr">15: </span>          <span style="color: #8BD49C;">}</span><span style="color: #E27E8D;">)</span>.queryParam<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"db"</span>, <span style="color: #D95468;">Generator</span>.db<span style="color: #E27E8D;">)</span>
<span class="linenr">16: </span>
<span class="linenr">17: </span>  <span style="color: #5EC4FF;">val</span> <span style="color: #9CAABB;">scnw</span> <span style="color: #5EC4FF;">=</span> scenario<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"write"</span><span style="color: #E27E8D;">)</span>.exec<span style="color: #E27E8D;">(</span>forever<span style="color: #8BD49C;">{</span>
<span class="linenr">18: </span>                                      exec<span style="color: #D98E48;">(</span>hw<span style="color: #D98E48;">)</span>.pace<span style="color: #D98E48;">(</span><span style="color: #E27E8D; font-weight: bold;">1</span> second, <span style="color: #E27E8D; font-weight: bold;">2</span> seconds<span style="color: #D98E48;">)</span>
<span class="linenr">19: </span>                                    <span style="color: #8BD49C;">}</span><span style="color: #E27E8D;">)</span>
<span class="linenr">20: </span>
<span class="linenr">21: </span>  <span style="color: #5EC4FF;">val</span> <span style="color: #9CAABB;">hr</span> <span style="color: #5EC4FF;">=</span> http<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"query"</span><span style="color: #E27E8D;">)</span>.
<span class="linenr">22: </span>    get<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"/query"</span><span style="color: #E27E8D;">)</span>.
<span class="linenr">23: </span>    queryParam<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"db"</span>, <span style="color: #D95468;">Generator</span>.db<span style="color: #E27E8D;">)</span>.
<span class="linenr">24: </span>    queryParam<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"q"</span>, <span style="color: #8BD49C;">{</span> session <span style="color: #5EC4FF;">=&gt;</span>
<span class="linenr">25: </span>                 <span style="color: #D95468;">Generator</span>.getQueryStringByUserId<span style="color: #D98E48;">(</span>session.userId, isWriter <span style="color: #5EC4FF;">=</span> <span style="color: #D95468;">false</span><span style="color: #D98E48;">)</span>
<span class="linenr">26: </span>               <span style="color: #8BD49C;">}</span><span style="color: #E27E8D;">)</span>
<span class="linenr">27: </span>
<span class="linenr">28: </span>  <span style="color: #5EC4FF;">val</span> <span style="color: #9CAABB;">scnr</span> <span style="color: #5EC4FF;">=</span> scenario<span style="color: #E27E8D;">(</span><span style="color: #7FA0B7;">"query"</span><span style="color: #E27E8D;">)</span>.
<span class="linenr">29: </span>    exec<span style="color: #E27E8D;">(</span>forever<span style="color: #8BD49C;">{</span>
<span class="linenr">30: </span>           exec<span style="color: #D98E48;">(</span>hr<span style="color: #D98E48;">)</span>.pause<span style="color: #D98E48;">{</span>session <span style="color: #5EC4FF;">=&gt;</span> <span style="color: #D95468;">Generator</span>.getIntervalByUserId<span style="color: #B62D65;">(</span>session.userId, isWriter <span style="color: #5EC4FF;">=</span> <span style="color: #D95468;">false</span><span style="color: #B62D65;">)</span><span style="color: #D98E48;">}</span>
<span class="linenr">31: </span>         <span style="color: #8BD49C;">}</span><span style="color: #E27E8D;">)</span>
<span class="linenr">32: </span>
<span class="linenr">33: </span>  setUp<span style="color: #E27E8D;">(</span>
<span class="linenr">34: </span>    scnw.inject<span style="color: #8BD49C;">(</span>rampUsers<span style="color: #D98E48;">(</span><span style="color: #D95468;">Generator</span>.userCount<span style="color: #D98E48;">)</span>.over<span style="color: #D98E48;">(</span><span style="color: #D95468;">Generator</span>.duringSeconds seconds<span style="color: #D98E48;">)</span><span style="color: #8BD49C;">)</span>,
<span class="linenr">35: </span>    scnr.inject<span style="color: #8BD49C;">(</span>rampUsers<span style="color: #D98E48;">(</span><span style="color: #D95468;">Generator</span>.userCount<span style="color: #D98E48;">)</span>.over<span style="color: #D98E48;">(</span><span style="color: #D95468;">Generator</span>.duringSeconds seconds<span style="color: #D98E48;">)</span><span style="color: #8BD49C;">)</span>
<span class="linenr">36: </span>  <span style="color: #E27E8D;">)</span>.protocols<span style="color: #E27E8D;">(</span>httpConf<span style="color: #E27E8D;">)</span>
<span class="linenr">37: </span><span style="color: #5EC4FF;">}</span>
</pre>
</div>

<p>
稍微赘言几句，这个test case里面定义了两套动作，一是write，以1到2秒的停顿时间，生成一个包含1到5000个点的BatchPoint，发送write请求到influxdb；二是query，以1分钟一次或是10分钟一次的速度，向influxdb请求1分钟或是10分钟或是30分钟或是1小时或是1天或是7天的数据。这其实是模拟了公司的一个需求。我们想知道的是到底单台influxdb能够容纳多少个用户实例。
</p>
</div>
</div>
</div>


    <div>
      <div class="post-meta">
        <span title="post date" class="post-info">2016-10-20</span>
        <span title="last modification date" class="post-info">2016-10-29</span>
        <span title="tags" class="post-info"><a href="/tags/influxdb/">influxdb</a>, <a href="/tags/go/">go</a></span>
        <span title="author" class="post-info">Shane Xu</span>
      </div>
      <section>
        <h2 class="chapter">Comments</h2>
        <div id="disqus_thread"></div>
        <script type="text/javascript">
          //var disqus_developer = 1;
          var disqus_identifier = "/blog/2016/10/20/influxdb-load-test-design";
          var disqus_url = "http://xusheng.org/blog/2016/10/20/influxdb-load-test-design";
          var disqus_shortname = 'shanexu';
          /* * * DON'T EDIT BELOW THIS LINE * * */
          (function() {
          var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
          dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
          (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
          })();
        </script>
        <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
        <a href="//disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
      </section>
      <script src="/media/js/main.js"></script>
        <script type="text/javascript">
         var _gaq = _gaq || [];
         _gaq.push(['_setAccount', 'UA-74684473-1']);
         _gaq.push(['_trackPageview']);
         (function() {
           var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
           ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
           var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
         })();
        </script>
      <div class="footer">
        <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
        <p>
          Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:xusheng0711@gmail.com">Shane Xu</a>
          &nbsp;&nbsp;-&nbsp;&nbsp;
          Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
          <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
        </p>
      </div>
    </div>

  </body>
</html>
